[
    {
      "id": 1,
      "title": "Medical Device User Interface Design",
      "date": "04/2024",
      "keywords": ["UI/UX", "Figma", "Communication", "Medical Devices"],
      "description": [
        "As part of a multidisciplinary team, I contributed to the redesign of the user interface for a medical system used in EEG monitoring and transcranial magnetic stimulation (TMS). The goal was to improve usability, streamline workflows, and modernise the interface based on technical requirements and user feedback.",

        "I began by reviewing customer-supplied technical specifications and closely analysing the existing user interface to understand system functionality. I also attended stakeholder briefings to identify user pain points and areas where the interface could be improved.",

        "Working with the project manager, I helped define the new system structure using wireframes and a flowchart to represent the user journey. This visual framework laid the foundation for interface redesign and ensured alignment with clinical and technical expectations.",

        "Using Figma, I designed a high-fidelity, clickable prototype based on the new architecture. I developed a style guide and created reusable components to ensure design consistency and support future scalability by the development team.",

        "The prototype was used in a formative usability study with expert users to gather insights and validate interface decisions. Both the flowchart and Figma prototype were handed over to software developers as a reference for building the production software."
      ],
      "images": [
                "/static/images/magstim-ui.png",
                "/static/images/magstim-flow.png"
            ],
      "featured": false
    },
    {
      "id": 2,
      "title": "EPSRC Vacation Award Internship",
      "date": "06/2020",
      "keywords": ["Research", "Excel", "Data Analysis", "3D Printing", "CAD"],
      "description": [
        "During a summer internship funded by an EPSRC Vacation Bursary at the University of Leeds’ Institute of Functional Surfaces, I worked on a research project investigating a novel inductive sensing technique to detect wear in non-conductive materials used in joint replacements. The project aimed to explore early-stage feasibility and inform future experimental development.",

        "I began by conducting a review of academic literature covering wear mechanisms and existing sensing techniques in total joint replacements, with a focus on non-conductive materials like UHMWPE. This background research provided context for the novel inductive approach and helped guide test design. I also summarised relevant findings to support protocol planning for lab work, ensuring the project was grounded in current scientific understanding.",

        "In collaboration with PhD students, I helped develop and test a sensor calibration procedure to establish baseline inductance readings. I analysed experimental data from previous tests in Excel, identifying trends and inconsistencies across batches of sensors. This work informed adjustments to calibration protocols and helped ensure measurement reliability before more complex testing.",

        "I assembled a working electrical circuit using inductive sensor PCBs, a breadboard, NI MyRIO controller, and LabVIEW software to visualise live sensor readings. I designed and ran simple proof-of-concept experiments to demonstrate that sensor inductance reliably decreased when a metal target embedded within a polymer material was exposed—validating the basic principle of the sensing method.",

        "To simulate wear in a controlled setting, I designed and 3D printed custom PEEK fixtures for mounting the sensors onto a UMT tribometer. I set up and conducted sliding wear tests and used Excel to analyse the output. Some tests showed a consistent drop in inductance over time, indicating successful detection of material removal, although results also highlighted sensitivity to noise and the need for further refinement."
      ],
      "images": [
                "/static/images/hip-replacement.jpg",
                "/static/images/epsrc-internship.png"
            ],
      "featured": true
    },
    {
      "id": 3,
      "title": "Isometric Force Measurement Device",
      "date": "03/2022",
      "keywords": ["Python", "Excel", "Web Development", "Research", "Technical Support"],
      "description": [
        "This project, developed during my role at Lucid as part of an Innovate UK-funded initiative, aimed to create a novel force measurement platform tailored for elite athletic performance analysis. I contributed across four key areas: testing, data analysis, applied research, and technical support — working closely with stakeholders and end users to ensure the system was effective, accurate, and practical for real-world use.",

        "In the testing phase, I led early-stage evaluations of prototype devices to improve usability and establish consistent procedures for capturing reliable data. A major focus was determining optimal body positions and configurations during testing. Recognising setup as a key factor in data repeatability, I developed a setup algorithm based on anthropometric ratios and CAD modelling to standardise the configuration process for users of varying heights.",

        "I developed a secure web application using Flask, SQLite and Chart.js to present data from testing to project stakeholders, potential end users and Innovate UK assessors. This application allowed for interactive data visualisation, enhancing user experience and facilitating informed decision-making. The app also included user authentication to ensure data security and privacy.",

        "My research efforts focused on investigating the biomechanics of running. I used wearable IMUs and high-speed video to capture running gait and kinematics at varying speeds. This work helped relate device outputs to real-world performance parameters, informing both setup recommendations and future academic studies. These findings were instrumental in bridging lab-based data with real-use athletic scenarios.",

        "Drawing on my detailed understanding of the device, I provided technical support for its use in external research, including studies by the University of Salford and Leicester City Football Club. I led live demonstrations and assisted academic users with both hardware and software. The University of Salford’s MRes study, which I supported, found strong correlations between device output and both gold-standard lab equipment and sprint performance metrics, validating the system's accuracy and practical value."
    ]
,
      "images": [
                "/static/images/leicester-demo.jpg", 
                "/static/images/biostrain-web.jpg",
                "/static/images/sprint-gait.jpg",
                "/static/images/setup-plot.png"
            ],
      "featured": true
    },
    {
      "id": 4,
      "title": "Pressure Sensing Medical System",
      "date": "06/2024",
      "keywords": ["Testing", "CAD", "Communication", "Regulatory Compliance", "Manufacturing"],
      "description": [
        "As part of a multidisciplinary team at Lucid, I worked on the in-house development of a pressure sensing system used in anorectal manometry and biofeedback procedures. This ISO 13485-compliant medical device includes a pressure-sensing probe, charging dock, and calibration unit, and has been deployed to medical centres across the UK. My responsibilities covered design, manufacturing, documentation, and testing of the system throughout its development lifecycle.",

        "I implemented design changes to key system components using SOLIDWORKS, incorporating feedback from clinicians and end users. I designed and fabricated tooling for both vacuum casting (polyurethane and silicone parts) and vacuum forming (ABS components), enabling repeatable, high-quality production of housing and functional elements. These design changes improved usability and manufacturability, playing a vital role in preparing the system for clinical use.",

        "To fulfil a commercial purchase order, I led the hands-on manufacture of 20 patient-ready systems. This included the complete assembly of pressure probes, calibration units, and docking stations using techniques such as 3D printing, laser cutting, vacuum casting, and soldering. I also performed both mechanical and electronic assembly, ensuring all units met stringent functional and safety standards before deployment.",

        "Maintaining high-quality documentation was a key part of my role. I updated and organised BOMs, production records, technical drawings, and design verification and validation reports to meet ISO 13485 standards. I also worked with project leads to streamline document management processes, ensuring audit readiness. This documentation has consistently met the rigorous standards of our annual ISO 13485 audits without issue.",

        "I conducted a range of standardised tests on the system as part of design verification and validation. These included accelerated aging studies, material compatibility assessments, and risk-based software testing aligned with ISO 14971. The testing results provided evidence of the system’s reliability, supporting its safe and effective use in clinical settings and informing further development decisions."
      ],

      "images": [
                "/static/images/anisys-system.png", 
                "/static/images/keymat-tool.png",
                "/static/images/verification.png",
                "/static/images/overmould.png"
            ],
      "featured": true
    },
    {
      "id": 5,
      "title": "Engineering Analysis of Reciprocating Saw for Plaster Cast Removal",
      "date": "09/2023",
      "keywords": ["System Modelling", "Python", "FEA", "Mechanical Engineering", "DC Motors", "Computational Analysis"],
      "description": [
        "This project, carried out in my current role at Lucid, focused on developing a next-generation reciprocating saw and vacuum system for plaster cast removal. Working with a commercial client, my contributions spanned mechanical analysis, motor selection, and structural evaluation of key components — supporting the design team in making informed, data-driven decisions across the product development cycle.",

        "To analyse the saw’s core mechanical system, I developed a Python-based mathematical model of the eccentric cam mechanism. This allowed for theoretical calculation of displacement, velocity, and acceleration profiles at various operating speeds. These outputs helped inform design parameters such as eccentricity and shaft offset, guiding decisions to ensure sufficient range of blade motion while minimising stress on critical components. The model also supported analysis of counterbalancing strategies to reduce reactive forces on the motor shaft and housing.",

        "For motor selection, I assessed multiple DC motor options by extracting torque-speed data from technical datasheets and plotting operational curves. I calculated the expected current draw under load and cross-referenced it with the motor’s thermal limits to avoid overheating. This analysis ensured that the final motor choice would reliably meet the torque and speed requirements of the saw during prolonged operation without risk of failure.",

        "I conducted finite element analysis (FEA) on polypropylene components designed to secure the vacuum tube during storage. The goal was to determine the required insertion/removal force and confirm that stresses remained within the material’s elastic range. By following FEA best practices for polymer analysis, I provided confidence in the robustness of the design and supported the decision to proceed with tooling for mass production, helping accelerate the project timeline.",

        "Overall, my work contributed to critical design decisions that improved the mechanical performance and manufacturability of the product. The combination of system-level modelling and detailed component analysis enabled the team to move forward with confidence in both function and feasibility, ensuring the product met operational requirements and was ready for scaled manufacturing."
      ],
      "images": [
                "/static/images/medezine-analysis.png", 
                "/static/images/maxon-motor.png",
                "/static/images/clip-fea.png"
            ],
      "featured": true
    },
    {
      "id": 6,
      "title": "SOLIDWORKS Associate Certification",
      "date": "01/2018",
      "keywords": ["CAD", "Mechanical Engineering", "Product Design"],
      "description": [
        "I earned my Certified SOLIDWORKS Associate (CSWA) certification while studying at the University of Leeds, following formal training in CAD fundamentals. The certification demonstrates my ability to create and interpret 3D models, assemblies, and 2D engineering drawings using SOLIDWORKS. Since then, I’ve continued to apply and expand these skills in my role as a Design Engineer—developing components, tooling, and prototypes across a range of medical and mechanical systems. The certification laid a strong foundation for my ongoing work in design for manufacture, precision modelling, and technical documentation."
      ],
      "images": [
                "/static/images/solidworks-certificate.png",
                "/static/images/uav-drawings.jpg"],
      "featured": false
    },
    {
      "id": 7,
      "title": "Fixed wing UAV Design",
      "date": "10/2020",
      "keywords": ["CAD", "Mechanical Engineering", "Aircraft Design", "Stability Analysis"],
      "description": [
        "As part of a university group project, I helped design an all-electric, fixed-wing UAV for urban building surveillance. The aircraft had to meet specific mission criteria, including autonomous operation, stable low-speed performance, and compatibility with CAA and FAR guidelines. The project was split into preliminary and detailed design phases.", 
        "I contributed to concept generation by developing a mission profile based on project requirements, producing early CAD layouts, and proposing component options such as batteries and payload cameras. I also performed weight estimations and ensured regulatory compliance was considered early in the design process.",
        "Working in a small group, I helped deliver our preliminary concept presentation to the wider class. Our design was selected to progress into the detailed design stage, where I took a more focused role in the aircraft’s stability and control systems.",
        "I led the stability and control analysis, determining the control surface sizing, centre of mass location, and stick-fixed neutral point. I worked closely with team members in propulsion, aerodynamics, and systems to ensure the aircraft would remain stable across the full mission profile.",
        "Our final design met all core mission specifications and demonstrated stable performance throughout the required flight envelope. This project gave me practical experience in multi-disciplinary collaboration, regulatory awareness, and technical communication—skills I continue to apply in professional design environments."
      ],
      "images": [
                "/static/images/surveillance-uav.png",
                "/static/images/uav-drawings.jpg"],
      "featured": false
    },
    {
      "id": 8,
      "title": "Forward-Swept Wing Optimisation",
      "date": "01/2021",
      "keywords": ["Design Optimisation", "Aircraft Design", "Computational Analysis", "Project Management"],
      "description": [
        "This Master’s group project, sponsored by ESDU, explored the aerodynamic and structural feasibility of a novel forward-swept crescent wing design for transonic passenger aircraft. The goal was to optimise the wing’s planform to balance aerodynamic efficiency with structural integrity under realistic flight conditions.", 
        "As project manager, I developed the project plan, created a Gantt chart, and led weekly meetings. I was also responsible for liaising with our university supervisor and the industrial sponsor to ensure alignment between our analysis goals and industry relevance.",
        "I led the aerodynamic performance assessment using ESDU’s Viscous Full Potential (VFP) method, a fixed-format CFD solver written in FORTRAN. I developed a MATLAB tool to automate the generation of input files, enabling rapid iteration and consistent evaluation across different planform geometries.",
        "I worked closely with teammates conducting structural analysis to create a coupled aero-structural workflow. This iterative approach allowed us to adjust the aerodynamic shape in response to structural constraints, improving the design’s resistance to aeroelastic distortion while preserving aerodynamic efficiency.",
        "The project produced a wing configuration that met aerodynamic performance targets while minimising aeroelastic effects. Our automated workflow enabled efficient parametric studies and design optimisation. The final submission received a first-class mark and was praised for both its technical depth and collaborative execution."
      ],
      "images": [
                "/static/images/3d-planform.png"
              ],
      "featured": false
    },
    {
      "id": 9,
      "title": "Scrimba Course: Build a Mobile App with Firebase",
      "date": "01/2025",
      "keywords": ["Web Development", "Frontend Development", "Progressive Web App (PWA)", "Firebase"],
      "description": [
        "As part of a hands-on course from Scrimba, I built a fully functional shopping list app using HTML, CSS, JavaScript, and Firebase Realtime Database. The app supports real-time data updates and can be installed on mobile devices as a Progressive Web App (PWA)—blurring the line between web and native apps.", 
        "I designed the interface using responsive HTML and CSS, applying styles to enhance usability across devices. JavaScript was used to manage the app’s logic, including dynamic updates, DOM manipulation, and input validation.",
        "I integrated Firebase to enable real-time data storage and retrieval. I learned to write Firebase security rules, retrieve and manage unique item IDs, and use the onValue function to display updates live in the UI as they occurred.",
        "The app allows users to add, display, and delete list items. It was enhanced with accessibility improvements, viewport settings, and a Web App Manifest, allowing users to install it directly onto their home screen like a native app.",
        "I deployed the application using Netlify, making it publicly accessible and easily shareable. This project deepened my understanding of web application structure, real-time databases, and how to build mobile-friendly experiences using only web technologies."
      ],
      "images": [
                "/static/images/shopping-list.png"
              ],
      "featured": false
    }
  ]
  